spend_income/app/controllers/incomes_controller.rb

  def index
    @incomes = Income.all
---
SELECT "incomes".* FROM "incomes"

  def create
    @income = Income.new(income_params)

    if @income.save
---
INSERT INTO "incomes" ("amount", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["amount", "10.0"], ["created_at", "2020-08-12 20:33:23.938188"], ["updated_at", "2020-08-12 20:33:23.938188"]]